"""Приветствие
На вход программе подается строка текста – имя человека. Напишите программу, которая выводит на экран
приветствие в виде слова «Привет» (без кавычек), после которого должна стоять запятая и пробел, а затем введенное
имя. """

# put your python code here
name = input()
print('Привет,', name)
