"""Повторяй за мной 2
Напишите программу, которая считывает три строки по очереди, а затем выводит их в обратной
последовательности, каждую на отдельной строчке. """

# put your python code here
str_1 = input()
str_2 = input()
str_3 = input()
print(str_3)
print(str_2)
print(str_1)
