"""Счастливая последовательность 1
В популярном сериале «Остаться в живых» использовалась последовательность чисел 4
8 15 16 23 42, которая принесла героям удачу и помогла сорвать джекпот в лотерее. Напишите программу, которая выводит
данную последовательность чисел с одним пробелом между ними. """

# put your python code here
print('4', '8', '15', '16', '23', '42')
