"""Повторяй за мной
Напишите программу, которая считывает три строки по очереди, а затем выводит их в той же
последовательности, каждую на отдельной строчке. """

# put your python code here
str_1 = input()
str_2 = input()
str_3 = input()
print(str_1)
print(str_2)
print(str_3)
