"""Здравствуй, мир!
Напишите программу, которая выводит на экран текст «Здравствуй, мир!» (без кавычек)."""

# put your python code here
print("Здравствуй, мир!")
