"""Три последовательных числа
Напишите программу вывода на экран трех последовательно идущих чисел, каждое на
отдельной строке. Первое число вводит пользователь, остальные числа вычисляются в программе. """

# put your python code here
num = int(input())
print(num)
print(num + 1)
print(num + 2)
