"""Стоимость покупки
Напишите программу, которая считает стоимость трех компьютеров, состоящих из монитора,
системного блока, клавиатуры и мыши. """

# put your python code here
a = int(input())
b = int(input())
c = int(input())
d = int(input())
total = 3 * (a + b + c + d)
print(total)
