"""Следующее и предыдущее
Напишите программу, которая считывает целое число, после чего на экран выводится следующее
и предыдущее целое число с пояснительным текстом. """

# put your python code here
num = int(input())
print(f"Следующее за числом {num} число: {num + 1}\nДля числа {num} предыдущее число: {num - 1}")
