"""Куб
Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра."""

# put your python code here
a = int(input())
print('Объем =', a * a * a)
print('Площадь полной поверхности =', 6 * a * a)
