"""Расстояние в метрах
Напишите программу, которая находит полное число метров по заданному числу сантиметров."""

# put your python code here
sm = int(input())
print(sm // 100)
