"""Кастомный разделитель
Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит
указанные строки через разделитель. """

char_0 = input()
char_1 = input()
char_2 = input()
char_3 = input()
print(char_1, char_2, char_3, sep=char_0)
