"""I like Python
Напишите программу, которая выводит на экран текст «I***like***Python» (без кавычек)."""

# put your python code here
print('I', 'like', 'Python', sep='***')
