"""Значение функции
Напишите программу вычисления значения функции f(a, b) по введеным целым значениям a и b."""

# put your python code here
a = int(input())
b = int(input())
f = 3 * (a + b) ** 3 + 275 * b * b - 127 * a - 41
print(f)
