"""Сумма трёх чисел
Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число
записано в отдельной строке. """

# put your python code here
x = int(input())
y = int(input())
z = int(input())
print(x + y + z)
