# Замени меня полностью
# На вход программе подается строка текста. Напишите программу, которая заменяет все вхождения цифры 1 на слово «one».

# put your python code here
s = input()
print(s.replace('1', 'one'))
