# Удали меня полностью
# На вход программе подается строка текста. Напишите программу, которая удаляет все вхождения символа «@».

# put your python code here
s = input()
print(s.replace('@', ''))
