# Список чисел
# На вход программе подается одно число nn. Напишите программу, которая выводит список [1, 2, 3, ..., n].

# put your python code here
n = int(input())
l = list(range(1, n+1))
print(l)
