# ФИО
# На вход программе подаются три строки: имя, фамилия и отчество. Напишите программу, которая выводит инициалы человека.

# put your python code here
i, f, o = input(), input(), input()
print(f[0] + i[0] + o[0])
