# sWAP cASE
# На вход программе подается строка. Напишите программу, которая меняет регистр символов, другими словами замените все
# строчные символы заглавными и наоборот.

# put your python code here
s = input()
print(s.swapcase())
