# Количество слов
# На вход программе подается строка текста, состоящая из слов, разделенных ровно одним пробелом. Напишите программу,
# которая подсчитывает количество слов в ней.

# put your python code here
s = input()
print(s.count(' ') + 1)
