"""Четное или нечетное?
Напишите программу, которая определяет, является число четным или нечетным."""

# put your python code here
num = int(input())
if num % 2 == 0:
    print('Четное')
else:
    print('Нечетное')
