# Список четных
# На вход программе подается четное число n, n ≥ 2. Напишите программу, которая выводит список четных чисел
# [2, 4, 6, ..., n].

# put your python code here
print([n for n in range(2, int(input()) + 1, 2)])
