"""Наименьшее из двух чисел
Напишите программу, которая определяет наименьшее из двух чисел."""

# put your python code here
a = int(input())
b = int(input())
if a < b:
    print(a)
else:
    print(b)
