# Дробная часть
# Дано положительное действительное число. Выведите его дробную часть.

# put your python code here
n = float(input())
print(n - int(n))
