# 451 градус по Фаренгейту
# У известного американского писателя Рэя Бредбери есть роман «451 градус по Фаренгейту». Напишите программу, которая
# определяет, какой температуре по шкале Цельсия соответствует указанное значение по шкале Фаренгейта.

# put your python code here
f = float(input())
print(5 / 9 * (f - 32))
