# Футбольная команда
# Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит фразу:
# «Футбольная команда [введённая строка] имеет длину [длина введённой строки] символов».

# put your python code here
name = input()
print(f"Футбольная команда {name} имеет длину {len(name)} символов")
