# Цвет настроения синий
# Напишите программу, которая считывает одну строку, после чего выводит «YES», если в введенной строке есть подстрока
# «синий» и «NO» в противном случае.

# put your python code here
s = input()
if 'синий' in s:
    print('YES')
else:
    print('NO')
