# What's Your Name?
# Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу:
# «Hello [введенное имя] [введенная фамилия]! You just delved into Python».

# put your python code here
firstname, lastname = input(), input()
print("Hello " + firstname + " " + lastname + "! You just delved into Python")
