# Площадь и длина
# Напишите программу определяющую площадь круга и длину окружности по заданному радиусу R.

# put your python code here
from math import pi
r = float(input())
print(pi * r * r)
print(2 * pi * r)
