# Пол и потолок
# Напишите программу, вычисляющую значение ... по заданному вещественному числу x.

# put your python code here
from math import *
x = float(input())
print(floor(x) + ceil(x))
