# Сумма квадратов VS квадрат суммы
# Напишите программу, которая считывает два целых числа a и b и выводит на экран квадрат суммы и сумму квадратов этих
# чисел.

# put your python code here
a = int(input())
b = int(input())
print(f"Квадрат суммы {a} и {b} равен {(a + b) ** 2}")
print(f"Сумма квадратов {a} и {b} равна {a * a + b * b}")
