# Большое число
# Как известно, целые числа в языке Python не имеют ограничений, которые встречаются в других языках программирования
# Напишите программу, которая считывает четыре целых положительных числа и выводит на экран значение выражения

# put your python code here
a = int(input())
b = int(input())
c = int(input())
d = int(input())
print(a ** b + c ** d)
