# Размножение n-ок
# Напишите программу, которая считывает целое положительное число n, n∈[1;9] и выводит значение числа

# put your python code here
n = int(input())
print(n * 100 + 2 * n * 10 + 3 * n)
