# Звездный прямоугольник
# Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

# put your python code here
print("*****************")
print("*               *")
print("*               *")
print("*****************")
