# Повторяй за мной 1
# Дано предложение и количество раз которое его надо повторить. Напишите программу, которая повторяет данное предложение
# нужное количество раз.

# put your python code here
text = input()
n = int(input())
for i in range(n):
    print(text)
