# Звездный прямоугольник
# На вход программе подается натуральное число n.
#
# Напишите программу, которая печатает звездный прямоугольник размерами n×19.

# put your python code here
n = int(input())
for i in range(n):
    print('*' * 19)
