# Python is awesome
# Напишите программу, которая выводит слова «Python is awesome!» (без кавычек) 10 раз.

# put your python code here
for i in range(10):
    print('Python is awesome!')
